{
    "Human Generated": {
        "Description": "This content has been entirely created by a human author."
    },
    "Machine Generated": {
        "Description": "This content has been entirely generated by an AI model."
    },
    "AI Assisted": {
        "Content Generation": {
            "Machine Intervention": "High",
            "Description": "AI algorithms were used to generate specific sections or portions of the article based on predefined criteria or data inputs."
        },
        "Media Generation": {
            "Machine Intervention": "High",
            "Description": "AI generative models were used to create images, videos or visual elements for the article."
        },
        "Paraphrasing/Rephrasing": {
            "Machine Intervention": "High",
            "Description": "AI algorithms were used to assist in rephrasing or paraphrasing certain sections of the article while maintaining the original meaning."
        },
        "Source Synthesis": {
            "Machine Intervention": "High",
            "Description": "AI was employed to synthesize information from multiple sources, analysing and combining data from different references to create the article."
        },
        "Automated Research": {
            "Machine Intervention": "High",
            "Description": "AI performed automated research on a given topic, aggregating and summarizing information from various sources included in the large language model's knowledge."
        },
        "Topic Generation": {
            "Machine Intervention": "Medium",
            "Description": "AI algorithms were used to suggest or generate topics for the article, assisting in the ideation process."
        },
        "Language Translation": {
            "Machine Intervention": "Medium",
            "Description": "AI was employed to translate the article from one language to another, assisting with linguistic nuances and idiomatic expressions."
        },
        "Content Summarization": {
            "Machine Intervention": "Medium",
            "Description": "AI was utilized to condense and summarize a larger piece of content, providing a concise overview."
        },
        "Grammar Enhancement": {
            "Machine Intervention": "Low",
            "Description": "AI was used to improve the article's grammar, punctuation, and overall linguistic accuracy."
        },
        "Content Structure Generation": {
            "Machine Intervention": "Low",
            "Description": "AI was used to assist in organizing and structuring the article, ensuring logical flow and coherence."
        }
    }
}
